{
  "name": "heart",
  "card": {
    "description": "A dataset of test results for heart disease patients, used to predict whether or not someone may have heart disease.",
    "source": "UCI (http://archive.ics.uci.edu/ml/datasets/Heart+Disease)",
    "lastUpdated": "1988",
    "context": {
      "createdBy": "1. Hungarian Institute of Cardiology. Budapest: Andras Janosi, M.D., University Hospital, Zurich, Switzerland: William Steinbrunn, M.D., University Hospital, Basel, Switzerland: Matthias Pfisterer, M.D., V.A. Medical Center, Long Beach and Cleveland Clinic Foundation: Robert Detrano, M.D., Ph.D.",
      "potentialUses": "Diagnose whether someone may be at risk for heart disease based on various factors.",
      "potentialMisuses": ""
    }
  },
  "fields": [
    { "type": "numerical", "id": "Age", "description": "Age of the patient." },
    { "type": "categorical", "id": "Sex", "description": "Biological sex of the patient." },
    { "type": "categorical", "id": "Chest Pain Type", "description": "Type of chest pain." },
    {
      "type": "numerical",
      "id": "Resting Blood Pressure",
      "description": "Whether they have chest pain, and if so whether it is anginal: a feeling like your heart is being squeezed."
    },
    { "type": "numerical", "id": "Cholesterol", "description": "Cholesterol in the blood." },
    {
      "type": "categorical",
      "id": "Fasting Blood Sugar > 120mg/dl",
      "description": "Whether or not their fasting blood sugar is high (above 120)."
    },
    {
      "type": "categorical",
      "id": "Resting ECG Results",
      "description": "The results of an echycardiogram: whether there are abnormalities detected in their heart."
    },
    {
      "type": "numerical",
      "id": "Maximum Heart Rate Achieved",
      "description": "During an exercise test, the highest the patient's heart rate reached."
    },
    {
      "type": "categorical",
      "id": "Exercise Induced Angina",
      "description": "Whether or not exercise induced angina in the patient"
    },
    {
      "type": "numerical",
      "id": "ST Depression Induced By Exercise Relative To Rest",
      "description": "The rate of ST depression (artery issues) caused by exercise, an indicator of heart issues."
    },
    {
      "type": "categorical",
      "id": "Slope of Peak Exercise ST Segment",
      "description": "The slope of their ST segment (the artery being measured) during exercise."
    },
    {
      "type": "numerical",
      "id": "Number of Major Vessels Colored by Flourosopy",
      "description": "Fluoroscopy is a process of mapping arteries to the heart: this shows how many blood vessels were highly visible in the process. A low or high number may correspond to heart disease."
    },
    {
      "type": "categorical",
      "id": "Diagnosis of Heart Disease",
      "description": "Whether or not the patient has heart disease."
    }
  ]
}
